src/Reports/ПоискУчастника/ПоискУчастника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПоискУчастника</name>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
  </tabularSections>
</mdclass:Report>

src/Documents/Расходная/Расходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расходная</name>
  <registerRecords>InformationRegister.ОбменССайтом</registerRecords>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Списать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Напечатано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискНикаСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>CatalogRef.ГруппыУчастников</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьОплачиваетОрганизатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыдачи</name>
    <type>
      <types>EnumRef.СтатусыВыдачиПокупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартаУчастника</name>
    <type>
      <types>CatalogRef.КартыУчастников</types>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылочныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробитЧекОтмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Потерян</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Пристрой</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплатить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСсылка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Праздники</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСпр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>БесплатнаяВыдача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетОрганизатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетУчастник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.КартыУчастников</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Участники/Участники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Участники</name>
  <predefined>
    <items>
      <name>нулевой</name>
      <description>NO_USER</description>
    </items>
  </predefined>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рэйтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьВыдачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьВыдачуКомментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерныйСписокКомментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегдаПечататьЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородСП</name>
    <type>
      <types>CatalogRef.ГородаСП</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/ПоискУчастника/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	ЗаполнитьТабДок(ТабДок, Поиск,ПоискСНачалаСтроки,ПоискТочноеСоответствие,ПоИД);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаполнитьТабДок(ТабДок,Поиск,ПоискСНачалаСтроки,ПоискТочноеСоответствие,поИД)
	    
		макет=Отчеты.ПоискУчастника.ПолучитьМакет("Макет");
	   облШапка=макет.ПолучитьОбласть("Шапка");
	   облЭлемент=макет.ПолучитьОбласть("Элемент");
	   облЭлементСКартой=макет.ПолучитьОбласть("ЭлементСКартой");
	   ТабДок.Очистить();

	   ТабДок.Вывести(ОблШапка);	   
	   
	   Запрос=Новый Запрос;
	   
	   Запрос.Текст= 
	   "ВЫБРАТЬ
	   |	Участники.Код КАК код,
	   |	Участники.Ссылка КАК Наименование,
	   |	Участники.Телефон1,
	   |	Участники.Телефон2,
	   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КартыУчастников.Ссылка) КАК КоличествоКарт
	   |ИЗ
	   |	Справочник.Участники КАК Участники
	   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КартыУчастников КАК КартыУчастников
	   |		ПО (КартыУчастников.Владелец = Участники.Ссылка)
	   |ГДЕ  "+?( не поИД,"
	   |	Участники.Наименование ПОДОБНО &Поиск СПЕЦСИМВОЛ ""\"" ","
	   |	Участники.Код = &Поиск ")+"
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	Участники.Ссылка,
	   |	Участники.Код,
	   |	Участники.Телефон1,
	   |	Участники.Телефон2
	   |
	   |УПОРЯДОЧИТЬ ПО
	   |	Участники.Наименование";
	 
	   ПоискСтр=СтрЗаменить(Поиск,"%","\%");
	   ПоискСтр=СтрЗаменить(ПоискСтр,"_","\_");
	   ПоискСтр=СтрЗаменить(ПоискСтр,"[","\[");
	   Если не поИд тогда
		   Запрос.УстановитьПараметр("Поиск",?(ПоискТочноеСоответствие,ПоискСТР ,?(ПоискСНачалаСтроки,   ПоискСтр+"%","%"+ПоискСтр+"%")));
	   Иначе
		   Запрос.УстановитьПараметр("Поиск",Число(Поиск));
	   КонецЕсли;
	   Результат=Запрос.Выполнить();
	   Выборка=Результат.Выбрать();
	   Пока Выборка.Следующий()  Цикл
		   
		   
		   Если Выборка.КоличествоКарт=0 Тогда
			   облЭлемент.Параметры.Код			=Выборка.Код;
			   облЭлемент.Параметры.Наименование	=Выборка.Наименование;
			   облЭлемент.Параметры.Телефон		=Выборка.Телефон1+"; "+Выборка.Телефон2;
			   
			   ТабДок.Вывести(облЭлемент);
		   Иначе 
			   
			   облЭлементСКартой.Параметры.Код			=Выборка.Код;
			   облЭлементСКартой.Параметры.Наименование	=Выборка.Наименование;
			   облЭлементСКартой.Параметры.Телефон		=Выборка.Телефон1+"; "+Выборка.Телефон2;
			   облЭлементСКартой.Параметры.Карт			=Выборка.КоличествоКарт;
			   ТабДок.Вывести(облЭлементСКартой);
		   КонецЕсли;
	   КонецЦикла;
	   
	   
   КонецПроцедуры

   
   
&НаСервереБезКонтекста
Функция ПолучитьСтоимостьПоискаНика()
	Возврат Константы.ПоискНикаСтоимость.Получить();
КонецФункции
   
   
   

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если Элемент.ТекущаяОбласть.Текст="ДобавитьКарту>>>" Тогда
		СП_РаботаСДокументами_Клиент.ОткрытьФорму_Продажа(Новый Структура("Участник", Расшифровка));
		//СформироватьКарту(Расшифровка);
	Иначе
		СформироватьРасход(Расшифровка,ПолучитьСтоимостьПоискаНика());
	КонецЕсли;
	СтандартнаяОбработка=ложь;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКарту(Участник)
	
	форма=ПолучитьФорму("Справочник.КартыУчастников.ФормаОбъекта");
	ДанныеФормы = Форма.Объект;
	ЗаполнитьНаСервере(ДанныеФормы,Участник,"Карта",0);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();

КонецПроцедуры
  
	
&НаКлиенте
Процедура СформироватьРасход(Участник,ПоискНикаСтоимость)
	Если   аСППрверкиКлиент.НаличиеОткрытыхОкон("Расходная") Тогда
    	Предупреждение("Существует не завершенная операция ВЫДАЧИ.Закройте все окна РАСХОДА и повторите попытку!!!",30,"Предупреждение");
		Возврат;		
	КонецЕсли;
	
	форма=ПолучитьФорму("Документ.Расходная.ФормаОбъекта",,,Истина);
	ДанныеФормы = Форма.Объект;
	ЗаполнитьНаСервере(ДанныеФормы,Участник,"Расход",ПоискНикаСтоимость);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
//	форма.КодУчастника=;
	Форма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура СформироватьПриход(РазобралиШК)
	Если   аСППрверкиКлиент.НаличиеОткрытыхОкон("Приходная") Тогда
    	Предупреждение("Существует не завершенная операция Поступления.Закройте все окна Прихода и повторите попытку!!!",30,"Предупреждение");
		Возврат;		
	КонецЕсли;
	
	форма=ПолучитьФорму("Документ.Приходная.ФормаОбъекта");
	ДанныеФормы = Форма.Объект;
	ЗаполнитьНаСервере(ДанныеФормы,РазобралиШК,"Приход",0);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
КонецПроцедуры

	
&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(НовыйОбъект,Участник,Форма,ПоискНикаСтоимость);
	
	Если Форма="Карта" Тогда
		НовыйОбъект.Владелец = Участник;
	ИначеЕсли  Форма="Расход" Тогда
		НовыйОбъект.Участник = Участник;
		НовыйОбъект.ПоискНикаСтоимость=ПоискНикаСтоимость;
		расх=ДанныеФормыВЗначение(НовыйОбъект,Тип("ДокументОбъект.Расходная"));
		расх.заполнитьОстатками();
		//расх.ЗаполнениеКодов();
		ЗначениеВДанныеФормы(расх,НовыйОбъект);
	ИначеЕсли  Форма="Приход" Тогда	
		Если Участник.СвояТочка<>Участник.ТочкаРаздачи Тогда
			НовыйОбъект.Транзит=Истина;
			НовыйОбъект.ТочкаНазначения=Участник.ТочкаРаздачи;
		КонецЕсли;	
	КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура ПоискТочноеСоответствиеПриИзменении(Элемент)
	ВидимостьПоискСначалаСтроки();
КонецПроцедуры

&НаКлиенте
Функция ВидимостьПоискСначалаСтроки()

	Если ПоискТочноеСоответствие Тогда
		Элементы.ПоискСНачалаСтроки.Видимость=ложь;
	Иначе
		Элементы.ПоискСНачалаСтроки.Видимость=Истина;
	КонецЕсли;	

КонецФункции // ВидимостьПоискСначалаСтроки()



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьЗаголовокФормы();
	//ОбщегоНазначения.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	Если отказ Тогда Возврат конецЕсли;

	//МенеджерОборудования.ПриНачалеРаботыСистемы();
	ПоискСНачалаСтроки=Константы.ПоискСНачалаСтроки.Получить();
	ПоискТочноеСоответствие=Константы.ПоискТочноеСоответствие.Получить();
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ВидимостьПоискСначалаСтроки();

	//Сканер штрихкода
  	СтоСП_Клиент.ПодключитьСканерШК(УникальныйИдентификатор);
	

	
КонецПроцедуры





&НаСервере
Процедура ОбновитьЗаголовокФормы()
	
	АвтоЗаголовок = Ложь;
	Период = ТекущаяДатаСеанса();
	
	ПредставлениеТекущейДаты = Формат(Период, "Л=ru_RU; ДФ='d MMMM, dddd'");
	
	Заголовок = СтрШаблон(НСтр("ru = 'Сегодня: %1'"), ПредставлениеТекущейДаты);
	Параметры.Заголовок = Заголовок;
КонецПроцедуры


&НаКлиенте
Процедура СчитатьШтрихКодВручную(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаВводаШК",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВвестиШтрихКодВручную_Завершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытаРасходная" Тогда
		ЭтаФорма.ТекущийЭлемент	= Элементы.Поиск;
	 	Элементы.Поиск.АктивизироватьПоУмолчанию=Истина;
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ВвестиШтрихКодВручную_Завершение(ШК, ДополнительныеПараметры) Экспорт
	ДанныеШК = новый массив;
	ДанныеШК.Добавить(ШК);
	ДанныеШК.Добавить(неопределено);
	глОбработкаОповещения("ScanData",ДанныеШК,"ПодключаемоеОборудование");	// Вставить содержимое обработчика.
КонецПроцедуры
